app/views/api/properties/show.json.jbuilder

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                json.extract! review, :id, :review, :rating, :created_at, :user_id
                json.extract! @users.find_by(id: review.user_id), :name