app/controllers/api/properties_controller.rb

    def index

        filters = filter_params

        if valid_searches(filters['cityFilter'].downcase, filters['placeFilter'].downcase)
            @properties = Property.includes(:reviews).with_attached_photos.filtered_properties(filters)
        else
            @properties = Property.includes(:reviews).with_attached_photos.all
        end
        @addresses = Address.all
---
SELECT "properties".* FROM "properties" WHERE 1=0
SELECT "reviews".* FROM "reviews" WHERE "reviews"."property_id" = $1  [["property_id", 1]]
SELECT "addresses".* FROM "addresses"

    def show

        @property = Property.with_attached_photos.includes(:reviews, :amenities, :reservations, :user, :address).find(params[:id])
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = $1  [["id", 1]]
SELECT "amenities".* FROM "amenities" WHERE "amenities"."id" IN ($1, $2, $3, $4, $5)  [["id", 1], ["id", 2], ["id", 3], ["id", 4], ["id", 5]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."property_id" = $1  [["property_id", 1]]