app/models/property.rb

SELECT "cities".* FROM "cities" WHERE "cities"."name" = $1  [["name", "Ch"]]
SELECT "addresses".* FROM "addresses" WHERE "addresses"."city_id" = $1  [["city_id", 4]]
---
    def self.filtered_properties(filters)

        city_name = filters['cityFilter'].downcase
        type_of_place = filters['placeFilter']
        if city_name != ''
            city_name = city_name.split(' ').map { |word| word[0].upcase + word.slice(1...word.length) }.join(' ')
            city_id = City.where(name: city_name).as_json[0]['id']
        end

        address_ids = Address.where(city_id: city_id).as_json.map { |address| address['id']}