app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "EZS2Z7xskBw3qDCzqL2U3g"], ["updated_at", "2021-05-12 17:52:02.649795"], ["id", 7]]
---
def reset_session_token
    self.session_token = User.generate_session_token
    self.save!